tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/system/solid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        solid_to_domain3
        {
            type        patch;
        }
    }
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            solid_to_air
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappa           solidThermo;
                QrNbr           Qr;
                Qr              none;
                kappaName       none;
                value           uniform 300;
            }

            solid_to_floor
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappa           solidThermo;
                QrNbr           none;
                Qr              none;
                kappaName       none;
                value           uniform 300;
            }

            solid_to_domain3
            {
                type            fixedValue;
                value           uniform 300.0;
            }
        }
    }
}

// ************************************************************************* //
